app/controllers/api/v1/packages_controller.rb

SELECT "packages".* FROM "packages"
SELECT COUNT(*) FROM "packages"
---
    def index
      packages = Api::V1::Package.all
      return render body: nil, status: 204 if packages.empty?

UPDATE "packages" SET "position" = $1, "updated_at" = $2 WHERE "packages"."id" = $3  [["position", 9], ["updated_at", "2019-01-17 18:49:10.195248"], ["id", "453e1a5e-c716-4b17-9ce0-343d1962968f"]]
INSERT INTO "packages" ("name", "description", "created_at", "updated_at", "position", "exam_level") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Sketchy"], ["description", "hello world"], ["created_at", "2019-01-27 21:00:49.374690"], ["updated_at", "2019-01-27 21:00:49.374690"], ["position", 6], ["exam_level", "step-2"]]
---
    def create
      package = Api::V1::Package

      return render body: nil, status: 400 if
          package.params_check_create(params[:name],
                                      params[:visible],
                                      params[:position],
                                      params[:exam_level])

      package.update_position_create(params[:position],
                                     params[:exam_level],
                                     params[:name])

      result = package.create_my(params[:name],
                                 params[:exam_level],
                                 params[:description],
                                 params[:visible],
                                 params[:position])

SELECT "packages".* FROM "packages" WHERE (exam_level = NULL AND position >= NULL)
UPDATE "packages" SET "name" = $1, "position" = $2, "slug" = $3, "updated_at" = $4 WHERE "packages"."id" = $5  [["name", "SketchyAbe4"], ["position", nil], ["slug", "abe4"], ["updated_at", "2019-01-18 13:29:01.972845"], ["id", "ae301f72-cce2-46ad-b3f5-d1ad551abb10"]]
---
    def update
      package = Api::V1::Package

      return render body: nil, status: 404 unless package.exists?(id: params[:id])
      return render body: nil, status: 400 if
          package.params_check_update(params[:exam_level],
                                      params[:visible],
                                      params[:position])

      package.update_position_update(params[:position],
                                     params[:exam_level],
                                     params[:id])

DELETE FROM "packages" WHERE "packages"."id" = $1  [["id", "dc73663f-9bda-42ef-bbd7-0e54dbe6783d"]]
SELECT  "packages".* FROM "packages" WHERE "packages"."id" = $1 LIMIT $2  [["id", "dc73663f-9bda-42ef-bbd7-0e54dbe6783d"], ["LIMIT", 1]]
---
    def destroy
      package = Api::V1::Package

      return render body: nil?, status: 404 unless
          package.exists?(id: params[:id])
      result = package.find(params[:id]).destroy