app/controllers/api/v1/sections_controller.rb

SELECT  "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT $2  [["id", "e5030e6f-3926-4bd4-9acd-b33e99908482"], ["LIMIT", 1]]
SELECT "sections".* FROM "sections"
---
    def show
      @sections = Api::V1::Section.find(params[:id])
      unless @sections.present?